In [228]:
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
import pandas as pd
# figsize is a tuple of the width and height of the figure in inches. we set the size of the plotted figure with this
matplotlib.rcParams["figure.figsize"]=(20,10)

In [229]:
df1=pd.read_csv('housePrices.csv')
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [230]:
#gives the numbers of rows and columns
df1.shape

(13320, 9)

In [231]:
df2=df1.drop(['area_type','society','balcony','availability'],axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [232]:
#finding out number of NA values
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [233]:
#dropping NA values as the number of NA is very small compared to size of our dataset. If that was not the case we would take the mean and fillout the the NA positions.
df3=df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [234]:
df3.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [235]:
#returns unique values. kind of like set in javascript
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [236]:
#Bedrooms and BHK both signify the same thing. We are going to create a separate column to store only the int values of both bedrooms and bhk.
df3['bedrooms']=df3['size'].apply(lambda x: int(x.split(' ')[0]))
df3.head()

C:\Users\yasee\AppData\Local\Temp/ipykernel_6020/1030587527.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bedrooms']=df3['size'].apply(lambda x: int(x.split(' ')[0]))

                   location       size total_sqft  bath   price  bedrooms
0  Electronic City Phase II      2 BHK       1056   2.0   39.07         2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00         4
2               Uttarahalli      3 BHK       1440   2.0   62.00         3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00         3
4                  Kothanur      2 BHK       1200   2.0   51.00         2

In [237]:
df3['bedrooms'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [238]:
#This shows we have an error. As it is not possible to have 43 bedrooms in a 2400 sqft house
df3[df3.bedrooms>20]

                       location        size total_sqft  bath  price  bedrooms
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0        27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0        43

In [239]:
#So we have to do more data cleaning. Lets checkout the unique values.
df3.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [240]:
def isFloat(x):
  try:
    float(x)
  except:
    return False
  return True

In [241]:
#The ~ returns values for which the values are not float.
df3[~df3['total_sqft'].apply(isFloat)].head(20)

,location,size,total_sqft,bath,price,bedrooms
30,Yelahanka,4 BHK,2100 - 2850,4.0,186.000,4
122,Hebbal,4 BHK,3067 - 8156,4.0,477.000,4
137,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,54.005,2
165,Sarjapur,2 BHK,1145 - 1340,2.0,43.490,2
188,KR Puram,2 BHK,1015 - 1540,2.0,56.800,2
410,Kengeri,1 BHK,34.46Sq. Meter,1.0,18.500,1
549,Hennur Road,2 BHK,1195 - 1440,2.0,63.770,2
648,Arekere,9 Bedroom,4125Perch,9.0,265.000,9
661,Yelahanka,2 BHK,1120 - 1145,2.0,48.130,2
672,Bettahalsoor,4 Bedroom,3090 - 5002,4.0,445.000,4
772,Banashankari Stage VI,2 BHK,1160 - 1195,2.0,59.935,2
775,Basavanagara,1 BHK,1000Sq. Meter,2.0,93.000,1
850,Bannerghatta Road,2 BHK,1115 - 1130,2.0,58.935,2
872,Singapura Village,2 BHK,1100Sq. Yards,2.0,45.000,2
886,Chandapura,1 BHK,520 - 645,1.0,15.135,1
927,Thanisandra,2 BHK,1000 - 1285,2.0,43.415,2
959,Kammasandra,1 BHK,650 - 665,1.0,18.410,1
990,Sarjapur,1 BHK,633 - 666,1.0,17.535,1
1019,Marathi Layout,1 Bedroom,5.31Acres,1.0,110.000,1
1086,Narasapura,2 Bedroom,30Acres,2.0,29.500,2

In [242]:
#Helper function to get the average of the sqft ranges and to ignore any other abnormal values
def average(range):
  values=range.split('-')
  #returnsa average for range values
  if len(values)==2:
    return (float(values[0])+float(values[1]))/2
  #for any other non float values returns none
  try:
    return float(range)
  except:
    return None

In [243]:
#Creating a deep copy
df4=df3.copy()
#Cleaning up the sqft column
df4['total_sqft']=df4['total_sqft'].apply(average)
df4.head()

                   location       size  total_sqft  bath   price  bedrooms
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07         2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00         4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00         3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00         3
4                  Kothanur      2 BHK      1200.0   2.0   51.00         2

In [244]:
#Deep copy i.e. there is no reference rather separate copies
df5=df4.copy()
#creating a new price per sqft column for better features service. This is feature engineering
df5['price_per_sqft']=df5.price*100000/df5.total_sqft
df5.head()

,location,size,total_sqft,bath,price,bedrooms,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000